//18.01.2023 Зингаров титулы ЭТРН
//02.02.2023 поиск
//14.03.2023-титул1, исправления для заполнения
//30.03.2023-заполнение минипоисковой
//11.04.2023-дополнение T1
//06.06.2023-продолжение Т1

//using System;
//using System.Collections.Generic;
//using System.Linq;
//using System.Web;
using Newtonsoft.Json;

namespace tis.Modules
{
  public class ETRN_Titul
   {
     public static string TITUL1=@"
{
 ""content"":
  {
     ""$$meta$$"": { ""ИдентификаторПроцесса"": """"  },
     ""ЭТРН"":
        {
            ""ВерсПрог"": ""КЛИЕНТЭДОБАЗОВАЯ 2.0.4.66"",
            ""TRNACLGROT"":
            {
                ""ПоФактХЖ"": ""Транспортная накладная, информация грузоотправителя"",
                ""КЭП"":
                 {
                    ""Организация"": ""\"" \"""",
                    ""ДействителенДо"": ""30.08.2023"",
                    ""Отпечаток"": """",
                    ""ЭП"": """",
                    ""ДействителенС"": ""30.08.2022"",
                    ""Сертификат"": """",
                    ""Должность"": ""руководитель отдела документооборота"",
                    ""Валидность"": ""1"",
                    ""ФИО"": ""  "",
                    ""Издатель"": ""\""АО \""ПФ \""СКБ КОНТУР\""\"""",
                    ""ДатаВремя"": ""27.12.2022 16:45:04"",
                    ""СерийныйНомер"": """"
                 },
                ""ГИС"":
                {
                    ""ВремяОтпр"": ""16:46:48"",
                    ""ДатаОтпр"": ""27.12.2022"",
                    ""КолОтправок"": 0,
                    ""DocflowId"": ""e8d1c1bb-85ec-11ed-bef6-c1e267ab5c4c"",
                    ""СтатусОбрГИС"": 5
                },
                ""ДатИнфГО"": ""27.12.2022"",
                ""Подписант"":
                {
                    ""СтатПодп"": ""1"",
                    ""ФИО"": {
                        ""Имя"": """",
                        ""Фамилия"": """",
                        ""Отчество"": """"
                    }
                },
                ""КНД"": ""1110339"",
                ""ВрИнфГО"": ""16:44:34""
            },
            ""ИД_ГО"": ""2LDD9D6FE8F-C427-4B14-BE89-100E5BB9C653"",
            ""ИД_ГП"": ""2LDB5FEBBA5-696B-44A6-B3A8-15290651E0E4"",
            ""СодИнфГО"": {
                ""СвТС"": {
                    ""Прицеп"":
                    [
                        {
                            ""ТипВлад"": ""1"",
                            ""ПарТС"":
                            {
                                ""Марка"": ""Isuzu"",
                                ""Грузопод"": 23,
                                ""Тип"": ""грузовой"",
                                ""Вместим"": 13
                            },
                            ""РегНомер"": ""О098ЕК196""
                        }
                    ],
                    ""ТС"":
                    {
                        ""ТипВлад"": ""1"",
                        ""ПарТС"":
                       {
                            ""Марка"": ""Isuzu"",
                            ""Грузопод"": ""23.00"",
                            ""Тип"": ""грузовой"",
                            ""Вместим"": ""13.00""
                        },
                        ""РегНомер"": ""О098ЕК196""
                    }
                },
                ""НомЗак"": ""Без номера"",
                ""НомерТрН"": ""трн12342434"",
                ""СвВодит"":
                [
                    {
                        ""ДатаВыдВУ"": ""08.11.2018"",
                        ""ИННФЛ"": """",
                        ""СерВУ"": ""5682"",
                        ""НомВУ"": ""080907"",
                        ""ФИО"": {
                            ""Имя"": """",
                            ""Фамилия"": """",
                            ""Отчество"": """"
                        },
                        ""Тлф"":
                        [
                            {
                                ""Тлф"": ""+7-909-090-90-90""
                            }
                        ]
                    }
                ],
                ""СвГруз"":
                {
                    ""ОпГруз"":
                    [
                        {
                            ""Марк"":
                            [
                                {
                                    ""Марк"": ""Отсутствует""
                                }
                            ],
                            ""ВидТар"": ""12"",
                            ""ПлМасГруз"":
                            {
                                ""МасБрутЗнач"": 55,
                                ""МасНетЗнач"": 55
                            },
                            ""КолМестГр"": 12,
                            ""Габар"":
                            {
                                ""ШирЗнач"": 0,
                                ""ДлЗнач"": 0,
                                ""ВысЗнач"": 0
                            },
                            ""НаимГруз"": ""Строительные материалы отгружены по ТТН №053499-0005"",
                            ""СостГруз"": ""Удовлетворительное"",
                            ""СпУпак"": ""Транспортная""
                        }
                    ]
                },
                ""УказГО"":
                {
                    ""СвПА"":
                    {
                        ""СпосПерУкПА"": ""Электронное уведомление перевозчика о переадресовке"",
                        ""ЛицоПА"": ""Грузоотправитель"",
                        ""КонтПА"":
                        {
                            ""Тлф"":
                            [
                                {
                                    ""Тлф"": ""+7-909-090-90-90""
                                }
                            ]
                        }
                    },
                    ""УкНормПрвз"": ""Отсутствуют""
                },
                ""СвГО"":
                {
                    ""РекИдентГО"":
                    {
                        ""ИдСв"":
                        {
                            ""СвЮЛУч"":
                            {
                                ""КПП"": """",
                                ""НаимОрг"": """",
                                ""ИННЮЛ"": """"
                            }
                        },
                        ""Контакт"":
                        {
                            ""Тлф"":
                            [
                                {
                                    ""Тлф"": ""+7-909-090-90-90""
                                }
                            ]
                        }
                    },
                    ""ГОЭксп"": ""0""
                },
                ""СвГП"":
                {
                    ""АдресДостГр"":
                    {
                        ""АдресРФ"":
                        {
                            ""Индекс"": ""249008"",
                            ""КодРегион"": ""40"",
                            ""Город"": ""г.Калуга"",
                            ""Улица"": ""Кирова"",
                            ""Дом"": ""88""
                        }
                    },
                    ""РекИдентГП"":
                    {
                        ""ИдСв"":
                        {
                            ""СвЮЛУч"":
                            {
                                ""КПП"": """",
                                ""НаимОрг"": """",
                                ""ИННЮЛ"": """"
                            }
                        },
                        ""Контакт"":
                        {
                            ""Тлф"":
                            [
                                {
                                    ""Тлф"": ""+7-909-090-90-90""
                                }
                            ]
                        }
                    }
                },
                ""СодОпер"": ""Лицом, осуществляющим погрузку груза, при указанных обстоятельствах передан водителю груз с указанными характеристиками"",
                ""ИспрТрН"":
                {
                    ""ДатаИспр"": ""06.12.2022"",
                    ""НомИспр"": 1
                },
                ""ДатаТрН"": ""06.12.2022"",
                ""СвПогруз"":
                {
                    ""ДатаФУбыт"": ""08.12.2022"",
                    ""НалКоорТочВрЗаяв"": ""1"",
                    ""СвЛицПогрГр"":
                    {
                        ""ИдентРекГО"":
                        {
                            ""ИННЮЛ"": ""1298715668""
                        },
                        ""СовпГОП"": ""1""
                    },
                    ""ДатаФПриб"": ""08.12.2022"",
                    ""UTCФУбыт"": ""+03:00"",
                    ""ВремяЗаявПогр"": ""11:11:11"",
                    ""НалКоорТочВрФУбыт"": ""1"",
                    ""КолМестПрием"": 20,
                    ""ФАдресПогр"":
                    {
                        ""АдресРФ"":
                        {
                            ""Индекс"": ""249000"",
                            ""КодРегион"": ""40"",
                            ""Город"": ""г. Балабаново"",
                            ""Улица"": ""50 лет Октября"",
                            ""Дом"": ""22""
                        }
                    },
                    ""ВремяФПриб"": ""10:22:22"",
                    ""МасБрутОтгр"": ""55"",
                    ""UTCЗаявПогр"": ""+03:00"",
                    ""ВладИнфр"":
                    {
                        ""ИдентРекГО"":
                        {
                            ""ИННЮЛ"": ""1298715668""
                        },
                        ""СовпГОВ"": ""1""
                    },
                    ""UTCФПриб"": ""+03:00"",
                    ""НалКоорТочВрФПогр"": ""1"",
                    ""ВремяФУбыт"": ""11:33:33"",
                    ""МетОпрМасс"": ""01"",
                    ""ДатаЗаявПогр"": ""08.12.2022""
                },
                ""ДатаЗак"": ""01.12.2022"",
                ""СвПер"":
                {
                    ""ИдСв"":
                    {
                        ""СвЮЛУч"":
                        {
                            ""КПП"": ""500301001"",
                            ""НаимОрг"": ""ООО Грузоперевозчик"",
                            ""ИННЮЛ"": ""5003116490""
                        }
                    },
                    ""Контакт"":
                    {
                        ""Тлф"":
                        [
                            {
                                ""Тлф"": ""+7-909-090-90-90""
                            }
                        ]
                    }
                },
                ""ОтметГО"":
                [
                    {
                        ""ДатаОтмет"": ""07.12.2022"",
                        ""ОбстОтмет"": ""невывоз груза по вине перевозчика"",
                        ""UTCОтмет"": ""+03:00"",
                        ""ВремяОтмет"": ""11:11:11"",
                        ""ДатВрОтмет"": ""07.12.2022T11:11:11+03:00"",
                        ""НалКоорТочВрОтм"": ""1""
                    }
                ]
            },
            ""ТипЭТРН"": ""ON_TRNACLGROT"",
            ""ВерсФорм"": ""5.01"",
            ""ИД_ТК"": ""2LD65E8F028-C377-48DB-945D-752768F08C9B"",
            ""GUID"": ""e923d89f-85ec-11ed-b7a4-157c246c4851"",
            ""ИдФайл"": ""ON_TRNACLGROT_""
        }
  }
}
";
 //------------------------------------------------------------------------------------
   // Главная структура JSON
 //-------------------------------------------------------------------------------------
public static void tituldebug()
 {
      return;
 }

public const string TITUL1min=@"
{
 ""content"":
 {
  ""$$meta$$"": { ""ИдентификаторПроцесса"": """"  },

  ""ЭТРН"":
  {
    ""СодИнфГО"":
    {
      ""СвГруз"":
      {
        ""ОпГруз"":
        [
          {
            ""НаимГруз"": """",
            ""СпУпак"": """",
            ""СостГруз"": ""Удовлетворительное"",
            ""ПлМасГруз"":
                { ""МасБрутЗнач"": """" },
            ""Марк"": [  {  ""Марк"": ""Отсутствует""  } ],
            ""КолМестГр"": """",
            ""ВидТар"": """"
          }
        ]
      },
      ""СвПогруз"":
       {
        ""ВладИнфр"":
        {
          ""СовпГОВ"": ""1"",
          ""ИдентРекГО"":
           {  ""ИННЮЛ"": """"  }
        },
        ""СвЛицПогрГр"":
        {
          ""ИдентРекГО"":
           { ""ИННЮЛ"": """" },
          ""СовпГОП"": ""1""
        },
        ""ФАдресПогр"":
        {
          ""АдресРФ"":
          {
            ""Район"": """",
            ""Индекс"": """",
            ""КодРегион"": """",
             ""Город"": """", /* */
             ""Улица"": """",
             ""Дом"": """"
          }
        },
        ""КолМестПрием"": """",   //06.06.2023
        ""МетОпрМасс"": """",
        ""МасБрутОтгр"": """",

        ""НалКоорТочВрФУбыт"": ""1"",
        ""UTCФУбыт"": ""+03:00"",
        ""ВремяФУбыт"": ""13:00:00"",
        ""ДатаФУбыт"": ""2023-03-14"",    //=2023-03-14
        ""НалКоорТочВрФПогр"": ""1"",
        ""UTCФПриб"": ""+03:00"",
        ""ВремяФПриб"": ""13:00:00"",
        ""ДатаФПриб"": ""2023-03-14"",

        ""НалКоорТочВрЗаяв"": ""1"",
        ""UTCЗаявПогр"": """",
        ""ВремяЗаявПогр"": """",
        ""ДатаЗаявПогр"": """"
      },
      ""СвПер"":
      {
        ""ИдСв"":
        {
          ""СвЮЛУч"":
          {
            ""НаимОрг"": ""ООО \"" \"""",
            ""КПП"": """",
            ""ИННЮЛ"": """"
          }
        },
        ""Контакт"":
        {
          ""Тлф"":
            [ { ""Тлф"": """"  } ]
        }
      },
      ""СвВодит"":
      [
        {
          ""НомВУ"": """",
          ""СерВУ"": """",
          ""ДатаВыдВУ"": """",
          ""Тлф"":
             [ { ""Тлф"": """" } ],
          ""ФИО"":
          {
            ""Фамилия"": """",
            ""Имя"": """",
            ""Отчество"": """"
          }
        }
      ],
      ""СвГП"":
      {
        ""АдресДостГр"":
        {
          ""АдресРФ"":
          {
              ""Индекс"": """",
              ""КодРегион"": """",
              ""Город"": """",       /*11.04.2023*/
              ""Улица"": """",         //выгрузить
              ""Дом"": """"
          }
        },
        ""РекИдентГП"":
        {
          ""ИдСв"":
          {
            ""СвЮЛУч"":
            {
              ""НаимОрг"": ""ООО \""-\"""",
              ""КПП"": """",
              ""ИННЮЛ"": """"
            }
          },
          ""Контакт"":
          {
            ""Тлф"":
            [ {  ""Тлф"": """" }  ]
          }
        }
      },
      ""СвГО"":
      {
        ""ГОЭксп"": ""0"",
        ""РекИдентГО"":
        {
          ""ИдСв"":
          {
            ""СвЮЛУч"":
            {
              ""НаимОрг"": ""ООО \""-\"""",
              ""КПП"": """",
              ""ИННЮЛ"": """"
            }
          },
 		  ""Адрес"":        //11.04.2023
            {
			  ""АдрРФ"":
                {
							""Район"": """",
							""Индекс"": """",
							""КодРегион"": """",
							""Корпус"": """",
							""Город"": """",
							""НаселПункт"": """",
							""Улица"": """",
							""Дом"": """",
							""Кварт"": """"
				}
			},

          ""Контакт"":
          {
            ""Тлф"":
            [ {  ""Тлф"": """"  } ]       //06.06.2023
          }
        }
      },
      ""УказГО"":
      {
        ""УкНормПрвз"": ""Отсутствуют"",
        ""СвПА"":
        {
          ""СпосПерУкПА"": ""Электронное уведомление перевозчика о переадресовке"",
          ""ЛицоПА"": ""Грузоотправитель"",
          ""КонтПА"":
          {
            ""Тлф"":
               [ {  ""Тлф"": """" } ]
          }
        }
      },
      ""СвТС"":
      {
        ""ТС"":
        {
          ""ТипВлад"": """",
          ""ПарТС"":
          {
            ""Вместим"": ""4"",
            ""Грузопод"": ""3"",
            ""Марка"": """",
            ""Тип"": ""грузовой""
          },
          ""РегНомер"": """"
        }
      },
      ""ДатаТрН"": """",
      ""НомерТрН"": """",
      ""НомЗак"": """",
      ""ДатаЗак"": """"
    },
    ""ИД_ГО"": """",
    ""ИД_ГП"": """",
    ""ИД_ТК"": """",
    ""GUID"": """",
    ""TRNACLGROT"":
    {
      ""Подписант"":
      {
        ""СтатПодп"": ""1"",
        ""ИдСистХран"": """",
        ""Должность"": """",
        ""ФИО"":  {  ""Фамилия"": """",  ""Имя"": """",  ""Отчество"": """"  }
      }
    }
  }


 }
}
";


 } //END ETRN_Titul class

  //------------------------------------------------------------------------------------------
  public class ETRN_Search
  {                                         //POST /api/v2/trn/document/list      Список документов Этрн (с фильтром)    public static string      SpisokALLdoc=@"{""folderId"":""1"",""groupId"":""9"",""paging"":{""page"":0,""rows"":25}, ""filter"":  { ""isNotRead"": false,
    ""isClosed"": false,
    ""doc"": {               ""num"": """",               ""startDate"": """",               ""endDate"": """",
               ""tripNum"": """",
               ""tsOrder"": """"
             },    ""driver"":
     { ""tsNumber"": """", ""driveridName"": """" },
  }, ""sort"":{}, ""value"": { ""category"": ""ETRN"" }
}";//Пример короткий   //30.03.2023    public static string SPISOKDOC=@"
{
  ""filter"":
    {
       ""isNotRead"": false,
       ""isClosed"": false,
       ""isNeedDispatcherSign"": false,
       ""isNeedDriverSign"": true,
       ""isNeedGOsign"": false,
       ""isNeedGPsign"": false,
       ""go"": { ""orgId"": ""ea4dd5e0-9c1f-11ea-b053-fa163e51507a"" },
       ""gp"": { ""orgId"": ""ea4dd5e0-9c1f-11ea-b053-fa163e51507b"" },
       ""doc"": { ""num"": ""TRANSPORTATION_141"",
                  ""startDate"": ""2020-06-05"",
                  ""endDate"": ""2020-06-05"",
                  ""tripNum"": ""10123"",
                  ""tsOrder"": ""18""
                },
       ""driver"": { ""tsNumber"": ""A125AA177"", ""driveridName"": "" "" },
       ""unloading"": { ""gln"": ""986030303030"" }
     },
  ""value"": { ""category"": ""ETRN"" },
  ""paging"": { ""page"": 0, ""rows"": 5 }
}
";
//     public static string DocListf()  //02.02.2023    не исп. 30.03.2023
//     {
//         string jsonstr=SPISOKDOC;
//         dynamic jsonse=JsonConvert.DeserializeObject(jsonstr);
//         string gotpr=jsonse.filtr.go.orgId;
//         string json2=JsonConvert.SerializeObject(jsonse);
//         return json2;
//     }
  } //  END ETRN_SEARCH class


}   //END namespace
